app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO `comments` (`name`, `created_at`, `issue_id`, `updated_at`, `content`) VALUES('no se pudo hacer', '2010-08-03 05:39:47', 1, '2010-08-03 05:39:47', 'asdkjaslfdjlasd')