app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT * FROM `courses`

  def show
    @course = Course.find(params[:id])
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)

  def edit
    @course = Course.find(params[:id])
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)

  def create
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save
---
INSERT INTO `courses` (`name`, `duration`, `created_at`, `cost`, `updated_at`, `teacher`, `currency`) VALUES('Ruby On Rails', '8 horas', '2010-08-03 13:50:00', '200', '2010-08-03 13:50:00', 'Abel A. Rosas', 'soles')

  def update
    @course = Course.find(params[:id])

    respond_to do |format|
      if @course.update_attributes(params[:course])
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
UPDATE `courses` SET `updated_at` = '2010-08-03 09:00:15', `currency` = 'dolares' WHERE `id` = 1