app/controllers/form_contacts_controller.rb

SELECT * FROM `form_contacts`
---
  def index
    @form_contacts = FormContact.all

SELECT * FROM `form_contacts` WHERE (`form_contacts`.`id` = 1)
---
  def show
    @form_contact = FormContact.find(params[:id])

SELECT * FROM `occupations`
---
  def new
    @form_contact = FormContact.new
    @cours = Course.find(:all)
    @occupations = Occupation.all

SELECT * FROM `occupations`
INSERT INTO `form_contacts` (`name`, `course`, `otherCourse`, `occupation`, `comment`, `created_at`, `updated_at`, `phone`, `age`, `email`) VALUES('khkj', 'hkjkhk', 'jkj', 'iuy', 'hsdkshdkjfshd', '2010-08-03 08:58:53', '2010-08-03 08:58:53', 'kjhkjh', 33, 'asd@ds.com')
---
  def create
    @form_contact = FormContact.new(params[:form_contact])
 @cours = Course.find(:all)
    @occupations = Occupation.all


    respond_to do |format|
      if @form_contact.save