app/controllers/occupations_controller.rb

SELECT * FROM `occupations`
---
  def index
    @occupations = Occupation.all

SELECT * FROM `occupations` WHERE (`occupations`.`id` = 2)
---
  def show
    @occupation = Occupation.find(params[:id])

INSERT INTO `occupations` (`name`, `created_at`, `updated_at`) VALUES('Empleado', '2010-08-03 13:54:28', '2010-08-03 13:54:28')
---
  def create
    @occupation = Occupation.new(params[:occupation])

    respond_to do |format|
      if @occupation.save