app/controllers/pages_controller.rb

  def home

    @issues = Issue.all

    session[:user] = User.find(1)
---
SELECT * FROM `issues`
SELECT * FROM `users` WHERE (`users`.`id` = 1)